class script(object):  
    START_TXT = """<b>ʜɪ {user},ɪᴍ ᴀ ᴩᴏᴡᴇʀꜰᴜʟʟ ᴀᴜᴛᴏ-ꜰɪʟᴛᴇʀ ʙᴏᴛ. ɪ ᴄᴀɴ ᴩʀᴏᴠɪᴅᴇ ᴀɴɪᴍᴇ ɪɴ yᴏᴜʀ ɢʀᴏᴜᴩ.

ɪᴛꜱ ᴇᴀꜱy ᴛᴏ ᴜꜱᴇ ᴍᴇ, ᴀᴅᴅ ᴍᴇ ᴛᴏ yᴏᴜʀ ɢʀᴏᴜᴩ ᴀɴᴅ ᴍᴀᴋᴇ ᴍᴇ ᴀᴅᴍɪɴ ɪ ᴡɪʟʟ ᴘʀᴏᴠɪᴅᴇ ᴀɴɪᴍᴇ ᴛʜᴇʀᴇ.
 
ɪ ᴄᴀɴ ꜱᴇɴᴅ ᴀɴɪᴍᴇ ɪɴ ᴩᴍ ᴛᴏᴏ ᴊᴜꜱᴛ ꜱᴇɴᴅ ᴀɴɪᴍᴇ ɴᴀᴍᴇ ᴡɪᴛʜ ᴄᴏʀʀᴇᴄᴛ ꜱᴩᴇʟʟɪɴɢ.</b>"""
    
    HELP_TXT = "𝖧𝗒𝗅𝗈𝗁 {}, 🙋🏻‍♂️"

    ABOUT_TXT = """○ 𝖬𝗒 𝖭𝖺𝗆𝖾 : {}
○ 𝖢𝗋𝖾𝖺𝗍𝗈𝗋 : <a href='https://t.me/light_yagam_i'>˹ᴀꜱʜᴡɪɴ˼</a>
○ 𝖫𝗂𝖻𝗋𝖺𝗋𝗒 : <a href='https://docs.pyrogram.org/'>ᴩʏʀᴏɢʀᴀᴍ</a>
○ 𝖫𝖺𝗇𝗀𝗎𝖺𝗀𝖾 : <a href='https://www.python.org/download/releases/3.0/'>ᴩyᴛʜᴏɴ 3</a>
○ 𝖣𝖺𝗍𝖺𝖻𝖺𝗌𝖾 : <a href='https://www.mongodb.com/'>ᴍᴏɴɢᴏDB</a>
○ 𝖲𝖾𝗋𝗏𝖾𝗋 : <a href='https://t.me/source_Codez/3/'>ᴄʟɪᴄᴋ ʜᴇʀᴇ</a>
○ 𝖡𝗎𝗂𝗅𝖽 𝖲𝗍𝖺𝗍𝗎𝗌 : v2.7.1 [ ꜱᴛᴀʙʟᴇ ]"""
   
    SOURCE_TXT = """ᴛʜɪꜱ ɪꜱ ᴀɴ ᴏᴘᴇɴ ꜱᴏᴜʀᴄᴇ ᴘʀᴏᴊᴇᴄᴛ.

ᴀʟʟ ᴛʜᴇ ꜰɪʟᴇꜱ ɪɴ ᴛʜɪꜱ ʙᴏᴛ ᴀʀᴇ ꜰʀᴇᴇʟʏ ᴀᴠᴀɪʟᴀʙʟᴇ ᴏɴ ᴛʜᴇ ɪɴᴛᴇʀɴᴇᴛ ᴏʀ ᴘᴏꜱᴛᴇᴅ ʙʏ ꜱᴏᴍᴇʙᴏᴅʏ ᴇʟꜱᴇ.  ᴊᴜꜱᴛ ꜰᴏʀ ᴇᴀꜱʏ ꜱᴇᴀʀᴄʜɪɴɢ ᴛʜɪꜱ ʙᴏᴛ ɪꜱ ɪɴᴅᴇxɪɴɢ ꜰɪʟᴇꜱ ᴡʜɪᴄʜ ᴀʀᴇ ᴀʟʀᴇᴀᴅʏ ᴜᴘʟᴏᴀᴅᴇᴅ ᴏɴ ᴛᴇʟᴇɢʀᴀᴍ. ᴡᴇ ʀᴇꜱᴘᴇᴄᴛ ᴀʟʟ ᴛʜᴇ ᴄᴏᴘʏʀɪɢʜᴛ ʟᴀᴡꜱ ᴀɴᴅ ᴡᴏʀᴋꜱ ɪɴ ᴄᴏᴍᴘʟɪᴀɴᴄᴇ ᴡɪᴛʜ ᴅᴍᴄᴀ ᴀɴᴅ ᴇᴜᴄᴅ. ɪꜰ ᴀɴʏᴛʜɪɴɢ ɪꜱ ᴀɢᴀɪɴꜱᴛ ʟᴀᴡ ᴘʟᴇᴀꜱᴇ ᴄᴏɴᴛᴀᴄᴛ ᴍᴇ ꜱᴏ ᴛʜᴀᴛ ɪᴛ ᴄᴀɴ ʙᴇ ʀᴇᴍᴏᴠᴇᴅ ᴀꜱᴀᴘ. ɪᴛ ɪꜱ ꜰᴏʀʙɪʙʙᴇɴ ᴛᴏ ᴅᴏᴡɴʟᴏᴀᴅ, ꜱᴛʀᴇᴀᴍ, ʀᴇᴘʀᴏᴅᴜᴄᴇ, ᴏʀ ʙʏ ᴀɴʏ ᴍᴇᴀɴꜱ, ꜱʜᴀʀᴇ, ᴏʀ ᴄᴏɴꜱᴜᴍᴇ, ᴄᴏɴᴛᴇɴᴛ ᴡɪᴛʜᴏᴜᴛ ᴇxᴘʟɪᴄɪᴛ ᴘᴇʀᴍɪꜱꜱɪᴏɴ ꜰʀᴏᴍ ᴛʜᴇ ᴄᴏɴᴛᴇɴᴛ ᴄʀᴇᴀᴛᴏʀ ᴏʀ ʟᴇɢᴀʟ ᴄᴏᴘʏʀɪɢʜᴛ ʜᴏʟᴅᴇʀ. ɪꜰ ʏᴏᴜ ʙᴇʟɪᴇᴠᴇ ᴛʜɪꜱ ʙᴏᴛ ɪꜱ ᴠɪᴏʟᴀᴛɪɴɢ ʏᴏᴜʀ ɪɴᴛᴇʟʟᴇᴄᴛᴜᴀʟ ᴘʀᴏᴘᴇʀᴛʏ, ᴄᴏɴᴛᴀᴄᴛ ᴛʜᴇ ʀᴇꜱᴘᴇᴄᴛɪᴠᴇ ᴄʜᴀɴɴᴇʟꜱ ꜰᴏʀ ʀᴇᴍᴏᴠᴀʟ. ᴛʜᴇ ʙᴏᴛ ᴅᴏᴇꜱ ɴᴏᴛ ᴏᴡɴ ᴀɴʏ ᴏꜰ ᴛʜᴇꜱᴇ ᴄᴏɴᴛᴇɴᴛꜱ, ɪᴛ ᴏɴʟʏ ɪɴᴅᴇx ᴛʜᴇ ꜰɪʟᴇꜱ ꜰʀᴏᴍ ᴛᴇʟᴇɢʀᴀᴍ.

~ ᴍᴀɪɴᴛᴀɪɴᴇᴅ ʙʏ <a href='https://t.me/light_yagam_i'>˹ᴀꜱʜᴡɪɴ˼</a>"""

    FILE_TXT = """<b>Fɪʟᴇ sᴛᴏʀᴇ ɪs ᴛʜᴇ ғᴇᴀᴛᴜʀᴇ ᴡʜɪᴄʜ ᴡɪʟʟ ᴄʀᴇᴀᴛᴇ ᴀ sʜᴀʀᴇᴀʙʟᴇ ʟɪɴᴋ ᴏғ ᴀ sɪɴɢʟᴇ ᴏʀ ᴍᴜʟᴛɪᴘʟᴇ ғɪʟᴇs.</b>
   
• /batch - <code>Tᴏ ᴄʀᴇᴀᴛᴇ ᴀ ʙᴀᴛᴄʜ ʟɪɴᴋ ᴏғ ᴍᴜʟᴛɪᴘʟᴇ ғɪʟᴇs.</code>
• /link - <code>Tᴏ ᴄʀᴇᴀᴛᴇ ᴀ sɪɴɢʟᴇ ғɪʟᴇ sᴛᴏʀᴇ ʟɪɴᴋ.</code>"""
  
    FILTER_TXT = "ꜱᴇʟᴇᴄᴛ ᴡʜɪᴄʜ ᴏɴᴇ ʏᴏᴜ ᴡᴀɴᴛ...✨"
    
    GLOBALFILTER_TXT = """
<b>Wᴇʟᴄᴏᴍᴇ ᴛᴏ Gʟᴏʙᴀʟ Fɪʟᴛᴇʀs. Gʟᴏʙᴀʟ Fɪʟᴛᴇʀs ᴀʀᴇ ᴛʜᴇ ғɪʟᴛᴇʀs sᴇᴛ ʙʏ ʙᴏᴛ ᴀᴅᴍɪɴs ᴡʜɪᴄʜ ᴡɪʟʟ ᴡᴏʀᴋ ᴏɴ ᴀʟʟ ɢʀᴏᴜᴘs.</b>
    
Aᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅs:
• /gfilter - <code>Tᴏ ᴄʀᴇᴀᴛᴇ ᴀ ɢʟᴏʙᴀʟ ғɪʟᴛᴇʀ.</code>
• /gfilters - <code>Tᴏ ᴠɪᴇᴡ ᴀʟʟ ɢʟᴏʙᴀʟ ғɪʟᴛᴇʀs.</code>
• /delg - <code>Tᴏ ᴅᴇʟᴇᴛᴇ ᴀ ᴘᴀʀᴛɪᴄᴜʟᴀʀ ɢʟᴏʙᴀʟ ғɪʟᴛᴇʀ.</code>
• /delallg - <code>ᴛᴏ ᴅᴇʟᴇᴛᴇ ᴀʟʟ ɢʟᴏʙᴀʟ ꜰɪʟᴛᴇʀꜱ.</code>
• /g_filter - <code>off ᴜsᴇ ᴛʜɪs ᴄᴏᴍᴍᴏᴀɴᴅ + on/off ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴛᴏ ᴄᴏɴᴛʀᴏʟ ɢʟᴏʙᴀʟ ꜰɪʟᴛᴇʀ ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ</code>"""

    MANUELFILTER_TXT = """ʜᴇʟᴘ: <b>ꜰɪʟᴛᴇʀꜱ</b>
- ꜰɪʟᴛᴇʀ ɪꜱ ᴀ ꜰᴇᴀᴛᴜʀᴇ ᴡᴇʀᴇ ᴜꜱᴇʀꜱ ᴄᴀɴ ꜱᴇᴛ ᴀᴜᴛᴏᴍᴀᴛᴇᴅ ʀᴇᴘʟɪᴇꜱ ꜰᴏʀ ᴀ ᴘᴀʀᴛɪᴄᴜʟᴀʀ ᴋᴇʏᴡᴏʀᴅ ᴀɴᴅ ɪ ᴡɪʟʟ ʀᴇꜱᴘᴏɴᴅ ᴡʜᴇɴᴇᴠᴇʀ ᴀ ᴋᴇʏᴡᴏʀᴅ ɪꜱ ꜰᴏᴜɴᴅ ɪɴ ᴛʜᴇ ᴍᴇꜱꜱᴀɢᴇ

<b>ɴᴏᴛᴇ:</b>
1. ᴛʜɪꜱ ʙᴏᴛ ꜱʜᴏᴜʟᴅ ʜᴀᴠᴇ ᴀᴅᴍɪɴ ᴘʀɪᴠɪʟᴇɢᴇ.
2. ᴏɴʟʏ ᴀᴅᴍɪɴꜱ ᴄᴀɴ ᴀᴅᴅ ꜰɪʟᴛᴇʀꜱ ɪɴ ᴀ ᴄʜᴀᴛ.
3. ᴀʟᴇʀᴛ ʙᴜᴛᴛᴏɴꜱ ʜᴀᴠᴇ ᴀ ʟɪᴍɪᴛ ᴏꜰ 64 ᴄʜᴀʀᴀᴄᴛᴇʀꜱ.
Cᴏᴍᴍᴀɴᴅs Aɴᴅ Usᴀɢᴇ:
• /filter - <code>ᴀᴅᴅ ᴀ ꜰɪʟᴛᴇʀ ɪɴ ᴀ ᴄʜᴀᴛ</code>
• /filters - <code>ʟɪꜱᴛ ᴀʟʟ ᴛʜᴇ ꜰɪʟᴛᴇʀꜱ ᴏꜰ ᴀ ᴄʜᴀᴛ</code>
• /del - <code>ᴅᴇʟᴇᴛᴇ ᴀ ꜱᴘᴇᴄɪꜰɪᴄ ꜰɪʟᴛᴇʀ ɪɴ ᴀ ᴄʜᴀᴛ</code>
• /delall - <code>ᴅᴇʟᴇᴛᴇ ᴛʜᴇ ᴡʜᴏʟᴇ ꜰɪʟᴛᴇʀꜱ ɪɴ ᴀ ᴄʜᴀᴛ (ᴄʜᴀᴛ ᴏᴡɴᴇʀ ᴏɴʟʏ)</code>
• /g_filter- <code>off ᴜsᴇ ᴛʜɪs ᴄᴏᴍᴍᴏᴀɴᴅ + on/off ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴛᴏ ᴄᴏɴᴛʀᴏʟ ɢʟᴏʙᴀʟ ꜰɪʟᴛᴇʀ ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ</code>"""
    
    BUTTON_TXT = """ʜᴇʟᴘ: <b>ʙᴜᴛᴛᴏɴꜱ</b>
- ᴛʜɪꜱ ʙᴏᴛ ꜱᴜᴘᴘᴏʀᴛꜱ ʙᴏᴛʜ ᴜʀʟ ᴀɴᴅ ᴀʟᴇʀᴛ ɪɴʟɪɴᴇ ʙᴜᴛᴛᴏɴꜱ.

<b>ɴᴏᴛᴇ:</b>
1. ᴛᴇʟᴇɢʀᴀᴍ ᴡɪʟʟ ɴᴏᴛ ᴀʟʟᴏᴡꜱ ʏᴏᴜ ᴛᴏ ꜱᴇɴᴅ ʙᴜᴛᴛᴏɴꜱ ᴡɪᴛʜᴏᴜᴛ ᴀɴʏ ᴄᴏɴᴛᴇɴᴛ, ꜱᴏ ᴄᴏɴᴛᴇɴᴛ ɪꜱ ᴍᴀɴᴅᴀᴛᴏʀʏ.
2. ᴛʜɪꜱ ʙᴏᴛ ꜱᴜᴘᴘᴏʀᴛꜱ ʙᴜᴛᴛᴏɴꜱ ᴡɪᴛʜ ᴀɴʏ ᴛᴇʟᴇɢʀᴀᴍ ᴍᴇᴅɪᴀ ᴛʏᴘᴇ.
3. ʙᴜᴛᴛᴏɴꜱ ꜱʜᴏᴜʟᴅ ʙᴇ ᴘʀᴏᴘᴇʀʟʏ ᴘᴀʀꜱᴇᴅ ᴀꜱ ᴍᴀʀᴋᴅᴏᴡɴ ꜰᴏʀᴍᴀᴛ
<b>ᴜʀʟ ʙᴜᴛᴛᴏɴꜱ:</b>
<code>[Button Text](buttonurl:https://t.me/rzxbots)</code>
<b>ᴀʟᴇʀᴛ ʙᴜᴛᴛᴏɴꜱ:</b>
<code>[Button Text](buttonalert:ᴛʜɪꜱ ɪꜱ ᴀɴ ᴀʟᴇʀᴛ ᴍᴇꜱꜱᴀɢᴇ)</code>"""

    AUTOFILTER_TXT = """ʜᴇʟᴘ: <b>ᴀᴜᴛᴏ ꜰɪʟᴛᴇʀ</b>
<b>ɴᴏᴛᴇ: Fɪʟᴇ Iɴᴅᴇx</b>
1. ᴍᴀᴋᴇ ᴍᴇ ᴛʜᴇ ᴀᴅᴍɪɴ ᴏꜰ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ ɪꜰ ɪᴛ'ꜱ ᴘʀɪᴠᴀᴛᴇ.
2. ᴍᴀᴋᴇ ꜱᴜʀᴇ ᴛʜᴀᴛ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ ᴅᴏᴇꜱ ɴᴏᴛ ᴄᴏɴᴛᴀɪɴꜱ ᴄᴀᴍʀɪᴘꜱ, ᴘᴏʀɴ ᴀɴᴅ ꜰᴀᴋᴇ ꜰɪʟᴇꜱ.
3. ꜰᴏʀᴡᴀʀᴅ ᴛʜᴇ ʟᴀꜱᴛ ᴍᴇꜱꜱᴀɢᴇ ᴛᴏ ᴍᴇ ᴡɪᴛʜ Qᴜᴏᴛᴇꜱ. ɪ'ʟʟ ᴀᴅᴅ ᴀʟʟ ᴛʜᴇ ꜰɪʟᴇꜱ ɪɴ ᴛʜᴀᴛ ᴄʜᴀɴɴᴇʟ ᴛᴏ ᴍʏ ᴅʙ.

<b>ɴᴏᴛᴇ: ᴀᴜᴛᴏFɪʟᴛᴇʀ</b>
1. ᴀᴅᴅ ᴛʜᴇ ʙᴏᴛ ᴀs ᴀᴅᴍɪɴ ᴏɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ.
• /autofilter on - <code>ᴀᴜᴛᴏғɪʟᴛᴇʀ ᴇɴᴀʙʟᴇ ɪɴ ʏᴏʀ ᴄʜᴀᴛ</code>
• /autofilter off - <code>ᴀᴜᴛᴏғɪʟᴛᴇʀ ᴅɪsᴀʙʟᴇ ɪɴ ʏᴏᴜʀ ᴄʜᴀᴛ</code>

<b>ᴏᴛʜᴇʀ ᴄᴏᴍᴍᴀɴᴅs:</b>
• /set_template - <code>ꜱᴇᴛ ɪᴍᴅʙ ᴛᴇᴍᴘʟᴀᴛᴇ ꜰᴏʀ ʏᴏᴜʀ ɢʀᴏᴜᴘ</code> 
• /get_template - <code>ɢᴇᴛ ᴄᴜʀʀᴇɴᴛ ɪᴍᴅʙ ᴛᴇᴍᴘʟᴀᴛᴇ ꜰᴏʀ ʏᴏᴜʀ ɢʀᴏᴜᴘ</code>"""

    CONNECTION_TXT = """ʜᴇʟᴘ: <b>ᴄᴏɴɴᴇᴄᴛɪᴏɴꜱ</b>
- ᴜꜱᴇᴅ ᴛᴏ ᴄᴏɴɴᴇᴄᴛ ʙᴏᴛ ᴛᴏ ᴘᴍ ꜰᴏʀ ᴍᴀɴᴀɢɪɴɢ ꜰɪʟᴛᴇʀꜱ 
- ɪᴛ ʜᴇʟᴘꜱ ᴛᴏ ᴀᴠᴏɪᴅ ꜱᴘᴀᴍᴍɪɴɢ ɪɴ ɢʀᴏᴜᴘꜱ.

<b>ɴᴏᴛᴇ:</b>
1. ᴏɴʟʏ ᴀᴅᴍɪɴꜱ ᴄᴀɴ ᴀᴅᴅ ᴀ ᴄᴏɴɴᴇᴄᴛɪᴏɴ.
2. ꜱᴇɴᴅ <code>/ᴄᴏɴɴᴇᴄᴛ</code> ꜰᴏʀ ᴄᴏɴɴᴇᴄᴛɪɴɢ ᴍᴇ ᴛᴏ ʏᴏᴜʀ ᴘᴍ
Cᴏᴍᴍᴀɴᴅs Aɴᴅ Usᴀɢᴇ:
• /connect  - <code>ᴄᴏɴɴᴇᴄᴛ ᴀ ᴘᴀʀᴛɪᴄᴜʟᴀʀ ᴄʜᴀᴛ ᴛᴏ ʏᴏᴜʀ ᴘᴍ</code>
• /disconnect  - <code>ᴅɪꜱᴄᴏɴɴᴇᴄᴛ ꜰʀᴏᴍ ᴀ ᴄʜᴀᴛ</code>
• /connections - <code>ʟɪꜱᴛ ᴀʟʟ ʏᴏᴜʀ ᴄᴏɴɴᴇᴄᴛɪᴏɴꜱ</code>"""

    ADMIN_TXT = """ʜᴇʟᴘ:ᴀᴅᴍɪɴ ᴍᴏᴅs
<b>ɴᴏᴛᴇ:</b>
ᴛʜɪs ᴍᴏᴅᴜʟᴇ ᴏɴʟʏ ᴡᴏʀᴋs ꜰᴏʀ ᴍʏ ᴀᴅᴍɪɴs
ᴄᴏᴍᴍᴀɴᴅs ᴀɴᴅ ᴜsᴀɢᴇ:
• /logs - <code>ᴛᴏ ɢᴇᴛ ᴛʜᴇ ʀᴇᴄᴇɴᴛ ᴇʀʀᴏʀꜱ</code>
• /delete - <code>ᴛᴏ ᴅᴇʟᴇᴛᴇ ᴀ ꜱᴘᴇᴄɪꜰɪᴄ ꜰɪʟᴇ ꜰʀᴏᴍ ᴅʙ.</code>
• /deleteall - <code>ᴛᴏ ᴅᴇʟᴇᴛᴇ ᴀʟʟ ꜰɪʟᴇ ꜰʀᴏᴍ ᴅʙ.</code>
• /users - <code>ᴛᴏ ɢᴇᴛ ʟɪꜱᴛ ᴏꜰ ᴍʏ ᴜꜱᴇʀꜱ ᴀɴᴅ ɪᴅꜱ.</code>
• /chats - <code>ᴛᴏ ɢᴇᴛ ʟɪꜱᴛ ᴏꜰ ᴍʏ ᴄʜᴀᴛꜱ ᴀɴᴅ ɪᴅꜱ</code>
• /channel - <code>ᴛᴏ ɢᴇᴛ ʟɪꜱᴛ ᴏꜰ ᴛᴏᴛᴀʟ ᴄᴏɴɴᴇᴄᴛᴇᴅ ᴄʜᴀɴɴᴇʟꜱ</code>
• /broadcast - <code>ᴛᴏ ʙʀᴏᴀᴅᴄᴀꜱᴛ ᴀ ᴍᴇꜱꜱᴀɢᴇ ᴛᴏ ᴀʟʟ ᴜꜱᴇʀꜱ</code>
• /group_broadcast - <code>ᴛᴏ ʙʀᴏᴀᴅᴄᴀsᴛ ᴀ ᴍᴇssᴀɢᴇ ᴛᴏ ᴀʟʟ ᴄᴏɴɴᴇᴄᴛᴇᴅ ɢʀᴏᴜᴘs.</code>
• /leave  - <code>ᴛᴏ ʟᴇᴀᴠᴇ ꜰʀᴏᴍ ᴀ ᴄʜᴀᴛ.</code>
• /disable  - <code>ᴛᴏ ᴅɪꜱᴀʙʟᴇ ᴀ ᴄʜᴀᴛ.</code>
• /invite - <code>ᴡɪᴛʜ ᴄʜᴀᴛ ɪᴅ ᴛᴏ ɢᴇᴛ ᴛʜᴇ ɪɴᴠɪᴛᴇ ʟɪɴᴋ ᴏꜰ ᴀɴʏ ᴄʜᴀᴛ ᴡʜᴇʀᴇ ᴛʜᴇ ʙᴏᴛ ɪs ᴀᴅᴍɪɴ</code>
• /ban_user  - <code>ᴡɪᴛʜ ɪᴅ ᴛᴏ ʙᴀɴ ᴀ ᴜꜱᴇʀ</code>
• /unban_user  - <code>ᴡɪᴛʜ ɪᴅ ᴛᴏ ᴜɴʙᴀɴ ᴀ ᴜꜱᴇʀ</code>
• /restart - <code>ᴛᴏ ʀᴇsᴛᴀʀᴛ ᴛʜᴇ ʙᴏᴛ</code>
• /clear_junk - <code>ᴄʟᴇᴀʀ ᴀʟʟ ᴅᴇʟᴇᴛᴇ ᴀᴄᴄᴏᴜɴᴛ & ʙʟᴏᴄᴋᴇᴅ ᴀᴄᴄᴏᴜɴᴛ ɪɴ ᴅᴀᴛᴀʙᴀsᴇ</code>
• /clear_junk_group - <code>ᴄʟᴇᴀʀ ᴀᴅᴅ ʀᴇᴍᴏᴠᴇᴅ ɢʀᴏᴜᴘ ᴏʀ ᴅᴇᴀᴄᴛɪᴠᴀᴛᴇᴅ ɢʀᴏᴜᴘs ᴏɴ DB</code>"""


    STATUS_TXT = """<b>◉ ᴛᴏᴛᴀʟ ꜰɪʟᴇꜱ: <code>{}</code>
◉ ᴛᴏᴛᴀʟ ᴜꜱᴇʀꜱ: <code>{}</code>  
◉ ᴛᴏᴛᴀʟ ᴄʜᴀᴛꜱ: <code>{}</code>
◉ ᴜꜱᴇᴅ ᴅʙ ꜱɪᴢᴇ: <code>{}</code>
◉ ꜰᴇᴇᴇ ᴅʙ ꜱɪᴢᴇ: <code>{}</code></b>"""

    LOG_TEXT_G = """<b>#ɴᴇᴡ_ɢʀᴏᴜᴩ

◉ ɢʀᴏᴜᴩ: {a}
◉ ɢ-ɪᴅ: <code>{b}</code>
◉ ʟɪɴᴋ: @{c}
◉ ᴍᴇᴍʙᴇʀꜱ: <code>{d}</code>
◉ ᴀᴅᴅᴇᴅ ʙʏ: {e}

◉ ʙʏ: @{f}</b>"""
  
    LOG_TEXT_P = """#ɴᴇᴡ_ᴜꜱᴇʀ
    
◉ ᴜꜱᴇʀ-ɪᴅ: <code>{}</code>
◉ ᴀᴄᴄ-ɴᴀᴍᴇ: {}
◉ ᴜꜱᴇʀɴᴀᴍᴇ: @{}

◉ ʙʏ: @{}</b>"""
  
    GROUPMANAGER_TXT = """ʜᴇʟᴩ ꜰᴏʀ ɢʀᴏᴜᴩ ᴍᴀɴᴀɢᴇʀ

<b>ᴛʜɪꜱ ɪꜱ ʜᴇʟᴩ ᴏꜰ ʏᴏᴜʀ ɢʀᴏᴜᴩ ᴍᴀɴᴀɢɪɴɢ. ᴛʜɪꜱ ᴡɪʟʟ ᴡᴏʀᴋ ᴏɴʟʏ ꜰᴏʀ ɢʀᴏᴜᴩ ᴀᴅᴍɪɴꜱ</b>

<b>ᴄᴏᴍᴍᴀɴᴅ & ᴜꜱᴀɢᴇ:</b>
• /inkick - <code>ᴄᴏᴍᴍᴀɴᴅ ᴡɪᴛʜ ʀᴇǫᴜɪʀᴇᴅ ᴀʀɢᴜᴍᴇɴᴛs ᴀɴᴅ ɪ ᴡɪʟʟ ᴋɪᴄᴋ ᴍᴇᴍʙᴇʀs ꜰʀᴏᴍ ɢʀᴏᴜᴘ.</code>
• /instatus - <code>ᴛᴏ ᴄʜᴇᴄᴋ ᴄᴜʀʀᴇɴᴛ ꜱᴛᴀᴛᴜs ᴏғ ᴄʜᴀᴛ ᴍᴇᴍʙᴇʀ ꜰʀᴏᴍ ɢʀᴏᴜᴘ.</code>
• /dkick - <code>ᴛᴏ ᴋɪᴄᴋ ᴅᴇʟᴇᴛᴇᴅ ᴀᴄᴄᴏᴜɴᴛs</code>
• /ban - <code>ᴛo ʙᴀɴ ᴀ ᴜꜱᴇʀ ꜰᴏʀᴍ ᴛʜᴇ ɢʀᴏᴜᴩ</code>
• /unban - <code>ᴜɴʙᴀɴ ᴛʜᴇ ʙᴀɴɴᴇᴅ ᴜꜱᴇʀ</code>
• /tban - <code>ᴛᴇᴍᴩᴏʀᴀʀʏ ʙᴀɴ ᴀ ᴜꜱᴇʀ</code>
• /mute - <code>ᴛo ᴍᴜᴛᴇ ᴀ ᴜꜱᴇʀ</code>
• /unmute - <code>ᴛo ᴜɴᴍᴜᴛᴇ ᴛʜᴇ ᴍᴜᴛᴇᴅ ᴜꜱᴇʀ</code>
• /tmute - <code>ᴡɪᴛʜ ᴠᴀʟᴜᴇ ᴛo ᴍᴜᴛᴇ ᴜᴩ ᴛo ᴩᴀʀᴛɪᴄᴜʟᴀʀ ᴛɪᴍᴇ ᴇɢ: /tmute 2h ᴛo ᴍᴜᴛᴇ 2ʜᴏᴜʀ ᴠᴀʟᴜᴇꜱ ɪꜱ (m/h/d)</code>
• /pin - <code>ᴛᴏ ᴩɪɴ ᴀ ᴍᴇꜱꜱᴀɢᴇ ᴏɴ ʏᴏᴜʀ ᴄʜᴀᴛ</code>
• /unpin - <code>ᴛᴏ ᴜɴᴩɪɴ ᴛʜᴇ ᴍᴇꜱꜱᴀɢᴇ ᴏɴ ʏᴏᴜʀ ᴄʜᴀᴛ</code>
• /purge - <code>ᴅᴇʟᴇᴛᴇ ᴀʟʟ ᴍᴇssᴀɢᴇs ꜰʀᴏᴍ ᴛʜᴇ ʀᴇᴘʟɪᴇᴅ ᴛᴏ ᴍᴇssᴀɢᴇ, ᴛᴏ ᴛʜᴇ ᴄᴜʀʀᴇɴᴛ ᴍᴇssᴀɢᴇ</code> """

    EXTRAMOD_TXT = """<b>ʜᴇʟᴩ ꜰᴏʀ ᴇxᴛʀᴀ ᴍᴏᴅᴜʟᴇ</b>

<b>ᴊᴜꜱᴛ ꜱᴇɴᴅ ᴀɴʏ ɪᴍᴀɢᴇ ᴛᴏ ᴇᴅɪᴛ ɪᴍᴀɢᴇ ✨</b>

<b>ᴄᴏᴍᴍᴀɴᴅꜱ & ᴜꜱᴀɢᴇ:</b>
• /id - <code>ɢᴇᴛ ɪᴅ ᴏғ ᴀ ꜱᴘᴇᴄɪғᴇᴅ ᴜsᴇʀ</code>
• /info  - <code>ɢᴇᴛ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ᴀʙᴏᴜᴛ ᴀ ᴜsᴇʀ</code>
• /imdb  - <code>ɢᴇᴛ ᴛʜᴇ ꜰɪʟᴍ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ꜰʀᴏᴍ ɪᴍᴅʙ ꜱᴏᴜʀᴄᴇ</code>
• /paste [ᴛᴇxᴛ] - <code>ᴩᴀsᴛᴇ ᴛʜᴇ ɢɪᴠᴇɴ ᴛᴇxᴛ ᴏɴ ᴩᴀsᴛʏ</code>
• /tts [ᴛᴇxᴛ] - <code>ᴄᴏɴᴠᴇʀᴛ ᴛᴇxᴛ ᴛᴏ ꜱᴘᴇᴇᴄʜ</code>
• /telegraph - <code>ꜱᴇɴᴅ ᴍᴇ ᴛʜɪs ᴄᴏᴍᴍᴀɴᴅ ʀᴇᴘʟʏ ᴡɪᴛʜ ᴩɪᴄᴛᴜʀᴇ ᴏʀ ᴠɪᴅᴇᴏ ᴜɴᴅᴇʀ (𝟻ᴍʙ)</code>
• /json - <code>ʀᴇᴩʟʏ ᴡɪᴛʜ ᴀɴʏ ᴍᴇꜱꜱᴀɢᴇ ᴛᴏ ɢᴇᴛ ᴍᴇꜱꜱᴀɢᴇ ɪɴꜰᴏ (ᴜꜱᴇꜰᴜʟʟ ꜰᴏʀ ɢʀᴏᴜᴩ)</code>
• /written - <code>ʀᴇᴩʟʏ ᴡɪᴛʜ ᴛᴇxᴛ ᴛᴏ ɢᴇᴛ ꜰɪʟᴇ (ᴜꜱᴇꜰᴜʟʟ ꜰᴏʀ ᴄᴏᴅᴇʀꜱ)</code>
• /carbon - <code>ʀᴇᴘʟʏ ᴡɪᴛʜ ᴛᴇxᴛ ᴛᴏ ɢᴇᴛ ᴄᴀʀʙᴏɴᴀᴛᴇᴅ ɪᴍᴀɢᴇ</code>
• /font [ᴛᴇxᴛ] - <code>ᴛᴏ ᴄʜᴀɴɢᴇ ʏᴏᴜʀ ᴛᴇxᴛ ꜰᴏɴᴛs ᴛᴏ ꜰᴀɴᴄʏ ꜰᴏɴᴛ</code>
• /share - <code>ʀᴇᴘʟʏ ᴡɪᴛʜ ᴛᴇxᴛ ᴛᴏ ɢᴇᴛ ᴛᴇxᴛ ꜱʜᴀʀᴀʙʟᴇ ʟɪɴᴋ</code>
• /song [ɴᴀᴍᴇ] - <code>ᴛᴏ ꜱᴇᴀʀᴄʜ ᴛʜᴇ ꜱᴏɴɢ ɪɴ ʏᴏᴜᴛᴜʙᴇ</code>
• /video [ʟɪɴᴋ] - <code>ᴛᴏ ᴅᴏᴡɴʟᴏᴀᴅ ᴛʜᴇ ʏᴏᴜᴛᴜʙᴇ ᴠɪᴅᴇᴏ</code>"""    
    
    CREATOR_REQUIRED = "❗<b>ʏᴏᴜ ʜᴀᴠᴇ ᴛᴏ ʙᴇ ᴛʜᴇ ɢʀᴏᴜᴩ ᴄʀᴇᴀᴛᴏʀ ᴛᴏ ᴅᴏ ᴛʜᴀ</b>"
      
    INPUT_REQUIRED = "❗ **ᴀʀɢᴜᴍᴇɴ ʀᴇqᴜɪʀᴇᴅ**"
      
    KICKED = "✔️ ꜱᴜᴄᴄᴇꜱꜱꜰᴜʟʟʏ ᴋɪᴄᴋᴇᴅ {} ᴍᴇᴍʙᴇʀꜱ ᴀcᴄᴏʀᴅɪɴɢ ᴛᴏ ᴛʜᴇ ᴀʀɢᴜᴍᴇɴᴛꜱ ᴩrᴏᴠɪᴅᴇᴅ"
      
    START_KICK = "ʀᴇᴍᴏᴠɪɴɢ ɪɴᴀᴄᴛɪᴠᴇ ᴍᴇᴍʙᴇʀs ᴛʜɪs ᴍᴀʏ ᴛᴀᴋᴇ ᴀ ᴡʜɪʟᴇ"
      
    ADMIN_REQUIRED = "❗<b>ɪᴀᴍ ɴᴏᴛ ᴀᴅᴍɪɴ ɪɴ ᴛʜɪꜱ ᴄʜᴀᴛ ꜱᴏ ᴩʟᴇᴀꜱᴇ ᴀᴅᴅ ᴍᴇ ᴀɢᴀɪɴ ᴡɪᴛʜ ᴀʟʟ ᴀᴅᴍɪɴ ᴩᴇʀᴍɪꜱꜱɪᴏɴ</b>"
      
    DKICK = "✔️ ᴋɪᴄᴋᴇᴅ {} ᴅᴇʟᴇᴛᴇᴅ ᴀᴄᴄᴏᴜɴᴛꜱ ꜱᴜᴄᴄᴇꜱꜱꜰᴜʟʟʏ"
      
    FETCHING_INFO = "<b>ᴡᴀɪᴛ ɪ ᴡɪʟʟ ᴛᴀᴋᴇ ᴛʜᴇ ᴀʟʟ ɪɴꜰᴏ</b>"
   
    SERVER_STATS = """ꜱᴇʀᴠᴇʀ ꜱᴛᴀᴛꜱ:
 
Uᴩᴛɪᴍᴇ: {}
CPU ᴜꜱᴀɢᴇ: {}%
RAM ᴜꜱᴀɢᴇ: {}%
Tᴏᴛᴀʟ ᴅɪꜱᴋ: {}
Uꜱᴇᴅ ᴅɪꜱᴋ: {} ({}%)
Fʀᴇᴇ ᴅɪꜱᴋ: {}"""
    
    BUTTON_LOCK_TEXT = "ʜᴇʏ {query}\nᴛʜɪꜱ ɪꜱ ɴᴏᴛ ꜰᴏʀ ʏᴏᴜ. ꜱᴇᴀʀᴄʜ ʏᴏᴜʀ ꜱᴇʟꜰ"
   
    FORCE_SUB_TEXT = """<b>⚠️ ꜰᴏʟʟᴏᴡ ᴛʜɪs ʀᴜʟᴇs ⚠️</b>

<code>🇮🇳 Mᴀʟ : ആദ്യം ᴊᴏɪɴ ᴍʏ ᴜᴩᴅᴀᴛᴇꜱ ᴄʜᴀɴɴᴇʟ എന്ന ബട്ടൺ ക്ലിക്ക് ചെയ്തു ചാനലിൽ ജോയിൻ ചെയുക.. എന്നിട്ട് വീണ്ടു ബോട്ടിൽ വന്നിട്ട് ᴛʀʏ ᴀɢᴀɪɴ എന്ന ബട്ടൺ ക്ലിക്ക് ചെയ്താൽ ഫയൽ കിട്ടുന്നതായിരിക്കും

🇺🇸 Eɴɢ : Fɪʀsᴛ ᴄʟɪᴄᴋ ᴏɴ ᴛʜᴇ ᴊᴏɪɴ ᴍʏ ᴜᴩᴅᴀᴛᴇꜱ ᴄʜᴀɴɴᴇʟ ʙᴜᴛᴛᴏɴ ᴀɴᴅ ᴊᴏɪɴ ᴛʜᴇ ᴄʜᴀɴɴᴇʟ. ᴛʜᴇɴ ᴄᴏᴍᴇ ʙᴀᴄᴋ ᴛᴏ ᴛʜᴇ ʙᴏᴛ ᴄʟɪᴄᴋ ᴏɴ ᴛʀʏ ᴀɢᴀɪɴ ʙᴜᴛᴛᴏɴ ᴛᴏ ɢᴇᴛ ᴛʜᴇ ғɪʟᴇ...</code>"""
   
    WELCOM_TEXT = """<b>Hey {user} , Welcome to {chat}.</b>"""
  
    IMDB_TEMPLATE = """
🏷 ᴛɪᴛʟᴇ: <a href={url}>{title}</a>
🎭 ɢᴇɴʀᴇꜱ: {genres}
📆 ʏᴇᴀʀ: <a href={url}/releaseinfo>{year}</a>
🌟 ʀᴀᴛɪɴɢ: <a href={url}/ratings>{rating}</a>/10"""
   
  
 


   
  
 


